Revit 2026 API

# TemperatureRatingTypeSetInsert Method

---

Insert the specified TemperatureRating type into the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	TemperatureRatingType item
)
```
```vb
Public Overridable Function Insert (
	item As TemperatureRatingType
) As Boolean
```
```cpp
public:
virtual bool Insert(
	TemperatureRatingType^ item
)
```
```fsharp
abstract Insert :
        item : TemperatureRatingType -> bool
override Insert :
        item : TemperatureRatingType -> bool
```

#### Parameters

item TemperatureRatingType
    The TemperatureRating type to be inserted into the set.

#### Return Value

BooleanReturns whether the TemperatureRating type was inserted into the set.

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace